
const posts=[
    {
      title:'پیش‌نیاز یادگیری React (ری‌اکت) چیست؟',
      slug:'what-is-react',
      shortDescription:'در این مقاله در مورد ری اکت صحبت خواهیم کرد',
      description:'<p>مهمترین پیش نیاز یادگیری React جاوا اسکریپت است. هر چه تسلط شما بر جاوااسکریپت بیشتر باشد. در ادامه‌ی کار راحت‌تر می‌توانید کد نویسی کنید. اما برای شروع نیاز نیست که شما تسلط ۱۰۰٪ بر تمامی فیچرهای جاوااسکریپت داشته باشید. در حد معمولی که بتوانید کارهای عادی را با جاوااسکریپت بدون استفاده از هیچ پکیجی انجام دهید کافی است و می‌توانید یادگیری React را شروع کنید بعدا در صورت نیاز می‌توانید دانش جاوااسکریپت خود را افزایش دهید.</p><p>پیش‌نیاز دیگر یادگیری React آشنایی با html و css است. هرچه دانش شما در این زمینه بیشتر باشد شما می‌توانید خروجی‌های با کیفیت‌تری را تولید کنید.</p><p>برای بعضی از دانشجوها این سوال پیش می‌آید که آیا به دانش Node.js&nbsp;هم نیاز دارم؟ برای خروجی گرفتن از پروژه به Node.js&nbsp;نیاز داریم. ولی معمولا از ابزارهایی که قبلا این موارد را کانفیگ کرده‌اند استفاده می‌کنیم. و شما خیلی درگیر این موضوع نمی‌شوید که این کانفیگ چطور انجام می‌شود. و خیلی نیاز به دانش Node.js&nbsp;ندارید.</p>',
      image:'react.png',
      author:'حمید بلال زاده',
      insertedAt:'تیر ۱۴۰۱',
      categories:[{title:'برنامه نویسی',slug:'programming'},{title:'آموزش React',slug:'react'}]
    },
    {
      title:'مزایای React (ری اکت) چیست؟',
      slug:'مزایای-react',
      shortDescription:'در این مقاله در مورد ری اکت صحبت خواهیم کرد',
      description:'<p>از جمله مزایای React (ری اکت) می‌توان به موارد زیر اشاره کرد:</p><ul><li>استفاده از React (ری اکت) باعث افزایش سرعت توسعه نرم افزار می‌شود.</li><li>با ابزارها و معماری که دارد، رفع عیب و خطایابی نرم افزار راحت‌تر است.</li><li>یادگیری React راحت است. پیچیدگی زیادی ندارد. قابلیت توسعه خوبی هم دارد.</li><li>community بزرگی دارد افرادی زیادی از آن استفاده می‌کنند. به همین دلیل پکیج‌ها و کدهای آماده زیادی برای ما وجود دارد. و اکثر چالش‌هایی که ما با آنها روبرو می‌شویم توسط برنامه نویس های دیگر قبلا حل شده و به اشتراک گذاشته شده است.</li></ul>',
      image:'react.webp',
      author:'حمید بلال زاده',
      insertedAt:'تیر ۱۴۰۱',
      categories:[{title:'آموزش برنامه نویسی',slug:'programming'},{title:'آموزش React',slug:'react'}]

    },
    {
        title:'تفاوت React (ری اکت) با انگولار و vue چیست؟',
        slug:'diff-vue-angular',
        shortDescription:'در این مقاله در مورد ری اکت صحبت خواهیم کرد',
        description:'<p>در سطح اینترنت مقالات زیادی در مورد تفاوت React (ری اکت) با AngularJS و Vue.js وجود دارد که اگر همه آنها را بررسی کنید به این نتیجه می‌رسید که همه چیز بستگی به شرایط پروژه دارد. پس به صورت مطلق نمی‌توان گفت که از کدام یک از این ابزارها می‌توان استفاده کرد. عوامل زیادی در انتخاب یک ابزار وجود دارد که خیلی از آنها فنی نیست مثلا نیروی انسانی در دسترس و زبانی که می خواهیم توسعه دهیم و ... در انتخاب تاثیر دارد.</p><p>به طور کلی همه این ابزارها قدرتمند هستند. همه پروژه‌ها را می‌توان با آنها پیاده سازی کرد. تفاوتی که وجود دارد روش حل مسئله با آنها است.</p><p>در مورد سرعت و performance تفاوت آنچنان زیادی ندارند. چون همه این ابزارها از نظر performance مشکلی ندارند و میزان تسلط برنامه نویس است که بر performance خروجی تاثیر دارد.</p>',
        image:'react.png',
        author:'حمید بلال زاده',
        insertedAt:'تیر ۱۴۰۱',
        categories:[{title:'آموزش برنامه نویسی',slug:'programming'},{title:'آموزش React',slug:'react'}]
     }
  ]

  export default posts